Revit 2027 API
SolidGeometryOptions.SolidTag Property
 Optional solid tag for the Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SolidTag { get; set; }
Public Property SolidTag As Integer
	Get
	Set
public:
property int SolidTag {
	int get ();
	void set (int value);
}
member SolidTag : int with get, set
Property Value
Int32
See Also
Reference
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace